In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])

In [4]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [8]:
df.apply(np.sum,axis='columns')

0    13
1    13
2    13
dtype: int64

In [9]:
df.apply(np.sum,axis='rows')

A    12
B    27
dtype: int64

In [10]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [11]:
df.apply(lambda x : [1,2],axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [15]:
df.apply(lambda x : [1,2],axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [17]:
df.apply(lambda x : [1,2],axis=1,result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [18]:
df.apply(lambda x : pd.Series([1,2],index = ['foo','bar']),axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [19]:
df.apply(lambda x : pd.Series([1,2],index = ['foo','bar']),axis=0)

     A  B
foo  1  1
bar  2  2

In [20]:
url = 'http://bit.ly/kaggletrain'
train = pd.read_csv(url)
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [21]:
#create a new column
train['Sex_num'] = train.Sex.map({'female':0,'male':1})

In [24]:
train.loc[0:4,['Sex','Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [26]:
#we want to calculate length of string in each string in "Name" column
#create a column
#we are applying Python's len function
train['Name_Length'] = train['Name'].apply(len)

In [28]:
#the apply method applies the function to each element
train.loc[0:4,['Name','Name_Length']]

                                                Name  Name_Length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [31]:
import numpy as np
#we look at the fair column and we think we need to round it up
train['Fare_Ceil'] = train['Fare'].apply(np.ceil)

In [36]:
train.loc[0:4,['Fare','Fare_Ceil']]

      Fare  Fare_Ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [37]:
train.loc[0:4,['Fare','Fare_Ceil']]

      Fare  Fare_Ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [41]:
#Let's extract last name of each person
#we will use str method
#now the series is the list of string
#each cell has 2 strings in a list as you can see below
train['Name'].str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [47]:
#we just want the first string from the list
#we create a function to retrive
def get_element(my_list,position):
    return my_list[position]

In [48]:
#use our created get_element function
#we pass position = 0
train['Name'].str.split(',').apply(get_element,position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

def get_element(my_list,position):
    return my_list[position[
names.str.split(',').apply(get_element,position=0)

In [52]:
#instead of above function we can use lambda function
#input x (the list in this case)
#output x[0] (the first string of the list in this case)
train['Name'].str.split(',').apply(lambda x : x[0])

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [55]:
#getting the second string
train['Name'].str.split(',').apply(lambda x : x[1])

0                                  Mr. Owen Harris
1       Mrs. John Bradley (Florence Briggs Thayer)
2                                      Miss. Laina
3               Mrs. Jacques Heath (Lily May Peel)
4                                Mr. William Henry
                          ...
886                                    Rev. Juozas
887                           Miss. Margaret Edith
888                 Miss. Catherine Helen "Carrie"
889                                Mr. Karl Howell
890                                    Mr. Patrick
Name: Name, Length: 891, dtype: object

apply() function as a dataframe method
applies a function on either axis of the dataframe

In [57]:
url = 'http://bit.ly/drinksbycountry'
drinks = pd.read_csv(url)
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [59]:
drinks.loc[:,'beer_servings':'wine_servings'].head()

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

In [60]:
#you want apply() method to travel axis=0 (downwards,column)
#apply Python's max function
drinks.loc[:,'beer_servings':'wine_servings'].apply(max,axis=0)  # axis=0 (downwards,column)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [61]:
#you want to apply() method to travel axis = 1 (right,row)
drinks.loc[:,'beer_servings':'wine_servings'].apply(max,axis=1) #axis = 1 (right,row)

0        0
1      132
2       25
3      312
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Length: 193, dtype: int64

In [65]:
#finding which column is maximum's category name
drinks.loc[:,'beer_servings':'wine_servings'].apply(np.argmax,axis=1) #axis = 1 (right,row)

0        beer_servings
1      spirit_servings
2        beer_servings
3        wine_servings
4        beer_servings
            ...
188      beer_servings
189      beer_servings
190      beer_servings
191      beer_servings
192      beer_servings
Length: 193, dtype: object

applymap() as a DataFrame method

In [66]:
drinks.loc[:,'beer_servings':'wine_servings'].applymap(float).head()

   beer_servings  spirit_servings  wine_servings
0            0.0              0.0            0.0
1           89.0            132.0           54.0
2           25.0              0.0           14.0
3          245.0            138.0          312.0
4          217.0             57.0           45.0

In [67]:
#over writing the existing table
drinks.loc[:,'beer_servings':'wine_servings'] = drinks.loc[:,'beer_servings':'wine_servings'].applymap(float)

In [68]:
url = 'http://bit.ly/drinksbycountry'
drinks = pd.read_csv(url)

In [69]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [71]:
drinks.drop('continent',axis=1) 
#axis = 1 drops the column

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [73]:
#axis = 0 drops the row
drinks.drop(2,axis=0)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [74]:
#drop multiple rows
drop_rows = [0,1]
drinks.drop(drop_rows,axis=0)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America
6,Argentina,193,25,221,8.3,South America
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [76]:
#mean of each numeric column
drinks.mean(axis = 0)
#it is same as the command axis = 0 
#drinks.mean(axis=0)
#it instructs pandas to move vertically or axis = 0 (downward,column)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [77]:
#mean of each row
#drinks.mean(axis='column')
drinks.mean(axis=1).head() # axis = 1 (right,row)

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64